@Pavan976,
 sorry for late response
I have tried using *.aotu.tfvars file. Here is an examle.
1. config a resource in vpc.tf
```
resource "huaweicloud_vpc" "test" {
  name = var.vpc_name
  cidr = var.vpc_cidr
}
```
2. config variables in vpc_variable.tf
```
variable "vpc_name" {
  type = string
  default = "test"
}

variable "vpc_cidr" {
  type = string
  default = "172.16.0.0/16"
}
```
3. config variables in vpc.auto.tfvars
```
vpc_name = "zhangjishu-test"
vpc_cidr = "192.168.1.0/24"
```
Test steps:
1. run terraform plan with all 3 files above.
```
# huaweicloud_vpc.test will be created
  + resource "huaweicloud_vpc" "test" {
      + cidr                  = "192.168.1.0/24"
      + enterprise_project_id = (known after apply)
      + id                    = (known after apply)
      + name                  = "zhangjishu-test"
      + region                = (known after apply)
      + routes                = (known after apply)
      + status                = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
2. remove vpc.auto.tfvars and run terraform again
```
# huaweicloud_vpc.test will be created
  + resource "huaweicloud_vpc" "test" {
      + cidr                  = "172.16.0.0/16"
      + enterprise_project_id = (known after apply)
      + id                    = (known after apply)
      + name                  = "test"
      + region                = (known after apply)
      + routes                = (known after apply)
      + status                = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
If there is no *.auto.tfvars file, terraform will use the default values in definition of variables.
If there is a *.auto.tfvars file, terraform will override the default values with values in *.auto.tfvars file.

Hope this helps you.
